In [1]:
# data science
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import seaborn as sns
import datetime

# API
import requests
import json

# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, text, inspect, func

In [2]:
# Create Engine
engine = create_engine("sqlite:///combined_attacks.sqlite")
conn = engine.connect()

In [4]:
query = """SELECT * 
        FROM combined_attacks"""
df = pd.read_sql(query, conn)
df.head()

,case_number,date,year,attack_type,country,area,location,activity,name,sex,...,original_order,unnamed:_22,unnamed:_23,animal_type,count,latitude,longitude,details,month,day
0,2019.08.27,2019-08-27,2019.0,Provoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,Donald Walsh,M,...,6452.0,None,None,shark,172.0,29.025813,-80.927127,None,NaN,NaN
1,2019.08.21,2019-08-21,2019.0,Unprovoked,USA,Florida,"Fort Lauderdale, Broward County",Wading,Christian Mariani,M,...,6451.0,None,None,shark,6.0,26.122308,-80.143379,None,NaN,NaN
2,2019.08.20,2019-08-20,2019.0,Unprovoked,USA,Hawaii,"Napoopoo Park in Kealakekua Bay, The Big Island",Swimming,female,F,...,6450.0,None,None,shark,1.0,30.829423,-82.609586,None,NaN,NaN
3,2019.08.16,2019-08-16,2019.0,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Wading,Maggie Crum,M,...,6449.0,None,None,shark,172.0,29.025813,-80.927127,None,NaN,NaN
4,2019.08.11,2019-08-11,2019.0,Unprovoked,USA,Hawaii,"Makaha Beach, Oahu",Surfing,Max Keliikipi,M,...,6448.0,None,None,shark,1.0,-12.206631,-77.014699,None,NaN,NaN

In [5]:
query = """SELECT age, count(*) as count 
        FROM combined_attacks
        GROUP BY age
        ORDER BY count DESC;
        """
df = pd.read_sql(query, conn)
df.head()

    age  count
0   NaN    732
1  16.0     71
2  15.0     68
3  19.0     66
4  17.0     65